Tekla.Structures.Catalogs.BoltItemEnumerator
The BoltItemEnumerator class allows to loop through the bolt catalog items.
The following example returns true if an item with the standard A325N has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
BoltItemEnumerator BoltItemEnumerator = CatalogHandler.GetBoltItems();
while (BoltItemEnumerator.MoveNext())
{
BoltItem BoltItem = BoltItemEnumerator.Current as BoltItem;
if (BoltItem.Standard == "A325N")
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.BoltItemEnumerator.#ctor
The constructor takes as parameter the filter for which items from the catalog
will enumerate.

Tekla.Structures.Catalogs.BoltItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type BoltItem.

Tekla.Structures.Catalogs.BoltItemEnumerator.Current
Returns a bolt item instance of the current element.

Tekla.Structures.Catalogs.BoltItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.BoltItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.BoltItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.